{'id': '998244664', 'type': 'page', 'status': 'current', 'title': 'Mutual Authentication (Dictionary Entry)', 'macroRenderedOutput': {}, 'body': {'storage': {'value': '<h1 style="text-align: center;"><strong><span style="color: rgb(76,154,255);">Mutual Authentication</span></strong></h1><h2>Definitions</h2><h3>Definition 1</h3><p>A communication scheme where both communicating entities are authenticated to each other.</p><p>Mutual authentication requires more than two unilateral authentications in opposite directions, because of the relationship between these two opposite processes.</p><p>Mutual authentication protects against unauthorized access by mitigating man-in-the-middle attacks. In certain circumstances, it may mitigate DoS attacks as well.</p><p>When communication takes place between a server and a client, authentication of the client by the server may be incorrectly perceived as the only important security aspect. But without authentication of the server by the client, the server itself may be spoofed leading the way to multiple attacks. </p><h2>Related Terms</h2><ul><li><p><ac:link ac:card-appearance="inline"><ri:page ri:content-title="Authentication (Dictionary Entry)" ri:version-at-save="14" /><ac:link-body>Authentication (Dictionary Entry)</ac:link-body></ac:link> </p></li><li><p>Unilateral Authentication</p></li></ul><h2>Quotes</h2><blockquote><p><strong>SRP-8</strong></p><p>REQUIREMENT: The CSP SHALL ensure that all communications occur over a mutually authenticated protected channel. (5.3.3.2 #7)</p><p>SUPPLEMENTAL GUIDANCE: Mutually authenticated protected channels employ approved cryptography to encrypt communications between (sic)</p><p>Supervised remote identity proofing stations/kiosks are required to employ mutual authentication where both the station/kiosk and server authenticate to each other. This is most often accomplished through the use of mutual TLS. Upon successful mutual authentication, an encrypted communication channel is established between the workstation/kiosk and the server which protects the data exchanged between them.</p><p>ASSESSMENT OBJECTIVE: Confirm the CSP&rsquo;s supervised remote identity proofing stations or kiosks communicate with the identity service via mutually authenticated protected channels.</p><p>POTENTIAL ASSESSMENT METHODS AND OBJECTS: </p><p>Examine: one or both the of the following:</p><p>● <em>system documentation</em>, such as remote identity proofing station specifications; or<br />● an actual <em>supervised remote identity proofing station (kiosk) </em>employed by the CSP.</p></blockquote><p style="text-align: right;">(<ac:link ac:card-appearance="inline"><ri:page ri:space-key="BIB" ri:content-title="Fenton, 2020" ri:version-at-save="2" /><ac:link-body>Fenton, 2020</ac:link-body></ac:link>, p. 58-59)</p><blockquote><p><strong>3.2.2.4 Authentication and Data Integrity between ABAC Components</strong></p><p>The authorization service requires strong mutual authentication between ABAC components (e.g., PEP, PDP) when authorization service components exchange sensitive information. For each exchange, proof of origin, data integrity, and timeliness should be considered. For example, when the authorization service needs to obtain attributes from an authoritative attribute service, mutual authentication should be used, followed by mechanisms for validating message integrity and message origin. Authentication protocols based on strong methods (e.g., X.509 authentication) should be used to provide the level of assurance needed by both parties involved in the attribute exchange.</p></blockquote><p style="text-align: right;">(<ac:link ac:card-appearance="inline"><ri:page ri:space-key="BIB" ri:content-title="NIST SP 800-162, 2014" ri:version-at-save="2" /><ac:link-body>NIST SP 800-162, 2014</ac:link-body></ac:link>, p. 28)</p><blockquote><p><strong>RADIUS</strong></p><p>(&hellip;)</p><p><em>- Mutual authentication support</em>: Man-in-the-middle attacks are possible with one-way authentication. Mutual authentication eliminates this risk by authenticating the RADIUS server and the client. The client initially passes its identification to the server, which responds with its identification so that both the server and the client are assured of mutual reliability. The same happens with the AP and the server.</p></blockquote><p style="text-align: right;">(<ac:link ac:card-appearance="inline"><ri:page ri:space-key="BIB" ri:content-title="EC-Council, 2010" ri:version-at-save="1" /><ac:link-body>EC-Council, 2010</ac:link-body></ac:link>, &sect; 5-35)</p><blockquote><p><strong>DHCP Services</strong></p><p>(&hellip;)</p><p>RFC 3118 appends authentication to DHCP and permits a client to confirm whether a specific DHCP server can be relied on and whether a request for DHCP information originates from a client that is certified to use the network. This mutual authentication in DHCP presents the additional security advantage of helping to protect DHCP clients and servers from DoS attacks and unauthorized access. RFC 3118 describes a method that can present both individual certification and message confirmation. This helps a DHCP client verify the uniqueness of the DHCP server it chooses in an unsecured network environment. This operation is very helpful for both a standard company Ethernet network and an Internet service provider (ISP).</p></blockquote><p style="text-align: right;">(<ac:link ac:card-appearance="inline"><ri:page ri:space-key="BIB" ri:content-title="EC-Council, 2010" ri:version-at-save="1" /><ac:link-body>EC-Council, 2010</ac:link-body></ac:link>, &sect; 5-38-39)</p><blockquote><p><strong>11.4.2 Mutual Authentication</strong></p><p>The basic mechanisms for message freshness or principal-liveness introduced so far achieve so-called &quot;unilateral authentication&quot; which means that only one of the two protocol participants is authenticated. In mutual authentication, both communicating entities are authenticated to each other.</p><p>ISO and IEC have standardized a number of mechanisms for mutual authentication. A signature based mechanism named &quot;ISO Public Key Three-Pass Mutual Authentication Protocol&quot; [148] is specified in prot 11.1. We choose to specify this mechanism in order to expose a common misunderstanding on mutual authentication.</p><p>One might want to consider that mutual authentication is simply twice unilateral authentication; that is, mutual authentication could be achieved by applying one of the basic unilateral authentication protocols in &sect;11.4.1 twice in the opposite directions. However, this is not generally true!</p><p>A subtle relationship between mutual authentication and unilateral authentication was not clearly understood in an early stage of the ISO/IEC standardization process for prot 11.1. (&hellip;)</p></blockquote><p style="text-align: right;">(<ac:link ac:card-appearance="inline"><ri:page ri:space-key="BIB" ri:content-title="Mao, 2003" ri:version-at-save="4" /><ac:link-body>Mao, 2003</ac:link-body></ac:link>, &sect; 11.4.2)</p><blockquote><p><strong>mutual authentication</strong></p><p>Authentication of both ends of a communication session.</p><p><strong>Overview</strong></p><p>Traditional network authentication systems have centered around having the server authenticate the credentials of the client. They ignore authentication of the server by the client since it is assumed that the server is always a trusted entity. However, it is sometimes possible to spoof the identity of a server, especially in an Internet scenario in which information is sent over an insecure public communication system and is subject to eavesdropping, interception, and hijacking. Although simple consumer transactions such as users buying goods online may suffice with one-way authentication of clients by e-commerce servers, more costly business-to-business (B2B) and financial industry transactions need both ends of a communication channel to be authenticated before establishing a session and per- forming a transaction. <strong>Mutual authentication </strong>is the general term for any scheme by which both parties authenticate the other prior to sending sensitive information to each other.</p><p>One protocol that was developed for mutual authentication is Kerberos, a popular authentication protocol developed by the Massachusetts Institute of Technology (MIT) and used by Active Directory directory service in Microsoft Windows 2000 and Windows Server 2003. Other mutual authentication protocols include the following:</p><p>● Microsoft Challenge Handshake Authentication Protocol version 2 (MS-CHAPv2)<br />● Extensible Authentication Protocol/Transport Layer Security (EAP/TLS)<br />● Symmetric-Key Three-Pass Mutual Authentication Protocol defined in the ISO 9798 standard</p><p>See Also: <em>authentication</em>, <em>Kerberos</em></p></blockquote><p style="text-align: right;">(<ac:link ac:card-appearance="inline"><ri:page ri:space-key="BIB" ri:content-title="Tulloch, 2003" ri:version-at-save="3" /><ac:link-body>Tulloch, 2003</ac:link-body></ac:link>, p. 199)</p><h2>Bibliography</h2><ul><li><p><ac:link ac:card-appearance="inline"><ri:page ri:space-key="BIB" ri:content-title="EC-Council, 2010" ri:version-at-save="1" /><ac:link-body>EC-Council, 2010</ac:link-body></ac:link> </p></li><li><p><ac:link ac:card-appearance="inline"><ri:page ri:space-key="BIB" ri:content-title="Fenton, 2020" ri:version-at-save="2" /><ac:link-body>Fenton, 2020</ac:link-body></ac:link> </p></li><li><p><ac:link ac:card-appearance="inline"><ri:page ri:space-key="BIB" ri:content-title="Mao, 2003" ri:version-at-save="4" /><ac:link-body>Mao, 2003</ac:link-body></ac:link> </p></li><li><p><ac:link ac:card-appearance="inline"><ri:page ri:space-key="BIB" ri:content-title="NIST SP 800-162, 2014" ri:version-at-save="2" /><ac:link-body>NIST SP 800-162, 2014</ac:link-body></ac:link> </p></li><li><p><ac:link ac:card-appearance="inline"><ri:page ri:space-key="BIB" ri:content-title="Tulloch, 2003" ri:version-at-save="3" /><ac:link-body>Tulloch, 2003</ac:link-body></ac:link> </p></li></ul><h2>See Also</h2><ac:structured-macro ac:name="contentbylabel" ac:schema-version="4" data-layout="default" ac:macro-id="a2a0d859-2295-46b2-8f3f-09a862b09a42"><ac:parameter ac:name="showLabels">false</ac:parameter><ac:parameter ac:name="sort">title</ac:parameter><ac:parameter ac:name="cql">label = &quot;mutual-authentication&quot;</ac:parameter></ac:structured-macro>', 'representation': 'storage', 'embeddedContent': [], '_expandable': {'content': '/rest/api/content/998244664'}}, '_expandable': {'editor': '', 'atlas_doc_format': '', 'view': '', 'export_view': '', 'styled_view': '', 'dynamic': '', 'editor2': '', 'anonymous_export_view': ''}}, 'extensions': {'position': 1916167362}, '_expandable': {'childTypes': '', 'container': '/rest/api/space/DIC', 'metadata': '', 'operations': '', 'schedulePublishDate': '', 'children': '/rest/api/content/998244664/child', 'restrictions': '/rest/api/content/998244664/restriction/byOperation', 'history': '/rest/api/content/998244664/history', 'ancestors': '', 'version': '', 'descendants': '/rest/api/content/998244664/descendant', 'space': '/rest/api/space/DIC'}, '_links': {'editui': '/pages/resumedraft.action?draftId=998244664', 'webui': '/spaces/DIC/pages/998244664', 'context': '/wiki', 'self': 'https://open-measure.atlassian.net/wiki/rest/api/content/998244664', 'tinyui': '/x/OAGAOw', 'collection': '/rest/api/content', 'base': 'https://open-measure.atlassian.net/wiki'}}